SuhasMruthunjaya/SuhasMruthunjaya/HDA_Lec_Slides/Safety/070_SensorDiagnostics_FSM_code/10_PSOC2_SingleChannel.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ErikaOS_1_ee.h"
#include "ErikaOS_1_ee_tracing.h"
#include "EB_4_aliases.h"
#include "EB_4.h"
#include "EB_3_aliases.h"
#include "EB_3.h"
#include "EB_2_aliases.h"
#include "EB_2.h"
#include "EB_7_aliases.h"
#include "EB_7.h"
#include "EB_8_aliases.h"
#include "EB_8.h"
#include "EB_9_aliases.h"
#include "EB_9.h"
#include "EB_10_aliases.h"
#include "EB_10.h"
#include "LED_4_aliases.h"
#include "LED_4.h"
#include "EB_1_aliases.h"
#include "EB_1.h"
#include "EB_5_aliases.h"
#include "EB_5.h"
#include "BUTTON_1_aliases.h"
#include "BUTTON_1.h"
#include "isr_Button.h"
#include "BUTTON_2_aliases.h"
#include "BUTTON_2.h"
#include "BUTTON_3_aliases.h"
#include "BUTTON_3.h"
#include "BUTTON_4_aliases.h"
#include "BUTTON_4.h"
#include "LED_1_aliases.h"
#include "LED_1.h"
#include "LED_3_aliases.h"
#include "LED_3.h"
#include "LED_2_aliases.h"
#include "LED_2.h"
#include "UART_LOG.h"
#include "UART_PSOC.h"
#include "Pin_Engine_Mode_2_aliases.h"
#include "Pin_Engine_Mode_2.h"
#include "Pin_Engine_Mode_1_aliases.h"
#include "Pin_Engine_Mode_1.h"
#include "ENGINE_Direction.h"
#include "EB_Status_Reg_2.h"
#include "EB_6_aliases.h"
#include "EB_6.h"
#include "USBUART.h"
#include "USBUART_audio.h"
#include "USBUART_cdc.h"
#include "USBUART_hid.h"
#include "USBUART_midi.h"
#include "USBUART_pvt.h"
#include "USBUART_cydmac.h"
#include "USBUART_msc.h"
#include "Clock_SR.h"
#include "EB_Status_Reg_1.h"
#include "AnalogIN_1_aliases.h"
#include "AnalogIN_1.h"
#include "AnalogIN_3_aliases.h"
#include "AnalogIN_3.h"
#include "ADC_SAR_Seq.h"
#include "SCL_aliases.h"
#include "SCL.h"
#include "SDA_aliases.h"
#include "SDA.h"
#include "I2C.h"
#include "I2C_PVT.h"
#include "Pin_Encoder_B_aliases.h"
#include "Pin_Encoder_B.h"
#include "Pin_Encoder_A_aliases.h"
#include "Pin_Encoder_A.h"
#include "ENGINE_DECODER.h"
#include "ENGINE_DECODER_PVT.h"
#include "Clock_PWM.h"
#include "Pin_Engine_PWM_aliases.h"
#include "Pin_Engine_PWM.h"
#include "Pin_Safe_2_aliases.h"
#include "Pin_Safe_2.h"
#include "Pin_Safe_1_aliases.h"
#include "Pin_Safe_1.h"
#include "ENGINE_PWM.h"
#include "AnalogIN_2_aliases.h"
#include "AnalogIN_2.h"
#include "UART_LOG_IntClock.h"
#include "UART_PSOC_IntClock.h"
#include "USBUART_Dm_aliases.h"
#include "USBUART_Dm.h"
#include "USBUART_Dp_aliases.h"
#include "USBUART_Dp.h"
#include "ADC_SAR_Seq_SAR.h"
#include "ADC_SAR_Seq_IntClock.h"
#include "ADC_SAR_Seq_TempBuf_dma.h"
#include "ADC_SAR_Seq_FinalBuf_dma.h"
#include "ADC_SAR_Seq_IRQ.h"
#include "ENGINE_DECODER_isr.h"
#include "ENGINE_DECODER_Cnt16.h"
#include "cy_em_eeprom.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"

/*[]*/

